<?php
/**
 * The header for our theme
 *
 * This is the template that displays all of the <head> section and everything up until <div id="content">
 *
 * @link https://developer.wordpress.org/themes/basics/template-files/#template-partials
 *
 * @package belbovit
 */

?>
<!doctype html>

<head>
 <meta charset="UTF-8">
 <meta name="viewport" content="width=device-width, initial-scale=1.0">
 <link rel="stylesheet" href="<?php echo bloginfo('template_url'); ?>/styles/style.css">
 <link  rel="stylesheet" href="https://cdn.jsdelivr.net/npm/swiper@10/swiper-bundle.min.css"/>
 <link href="https://fonts.googleapis.com/css2?family=Montserrat:wght@300;400&display=swap" rel="stylesheet">
 
 <title>Document</title>

</head>

<body>
 <header class="fix1">
  <div class=" main-wrap absol">
    <div class="logo">
      <!-- <img src="<?php echo bloginfo('template_url'); ?>/img/logo/лого 4 2.png" alt=""> -->
						<?php the_custom_logo(); ?>
    </div>
    <div class=" nav-box">
      <div class="  top-info">
        <div class="top-info-wrap">
          <div class="top-ifo-item">
            <div class="top-info-item-wrap">
              <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_189_6406)">
                <path d="M10.0019 0C5.81796 0.00425364 2.42793 3.36801 2.42578 7.51734C2.42578 11.5544 9.41309 19.3773 9.70943 19.7059C9.85306 19.8651 10.0996 19.8786 10.26 19.7361C10.2707 19.7266 10.2808 19.7166 10.2904 19.7059C10.5868 19.3734 17.5741 11.5544 17.5741 7.51734C17.5719 3.36951 14.1842 0.00638046 10.0019 0ZM10.0019 18.8591C8.66835 17.3123 3.20561 10.8197 3.20561 7.51347C3.20561 3.79101 6.24838 0.773389 10.0019 0.773389C13.7553 0.773389 16.7981 3.79101 16.7981 7.51347C16.7981 10.8197 11.3354 17.32 10.0019 18.8591Z" fill="#FF7D04"/>
                <path d="M10.1381 3.96695C7.8705 3.96908 6.03399 5.79389 6.03613 8.04271C6.03828 10.2915 7.8783 12.1129 10.1459 12.1107C12.4119 12.1086 14.2478 10.2862 14.2478 8.03884C14.2435 5.79026 12.4054 3.96908 10.1381 3.96695ZM10.1381 11.3412C8.30116 11.3412 6.81207 9.86443 6.81207 8.04271C6.81207 6.22099 8.30116 4.74421 10.1381 4.74421C11.975 4.74421 13.464 6.22099 13.464 8.04271C13.4619 9.86356 11.974 11.3391 10.1381 11.3412Z" fill="#FF7D04"/>
                </g>
                <defs>
                <clipPath id="clip0_189_6406">
                <rect width="20" height="19.8347" fill="white"/>
                </clipPath>
                </defs>
              </svg>
              <p><?php echo carbon_get_post_meta('36','addres');?></p>
            </div>
          </div>
          <div class="top-ifo-item">
            <div class="top-info-item-wrap">
              <svg width="20" height="17" viewBox="0 0 20 17" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M17.5584 0.967041H2.44568C1.09663 0.967041 0 2.06268 0 3.41052V13.7302C0 15.078 1.09663 16.1737 2.44568 16.1737H17.5543C18.9034 16.1737 20 15.078 20 13.7302V3.41465C20.0041 2.06681 18.9075 0.967041 17.5584 0.967041ZM18.8868 13.7302C18.8868 14.462 18.2909 15.0573 17.5584 15.0573H2.44568C1.71322 15.0573 1.11732 14.462 1.11732 13.7302V3.41465C1.11732 2.68285 1.71322 2.08748 2.44568 2.08748H17.5543C18.2868 2.08748 18.8827 2.68285 18.8827 3.41465V13.7302H18.8868Z" fill="#FF7D04"/>
              <path d="M12.6113 8.39988L17.5027 4.01707C17.7303 3.81033 17.751 3.45888 17.5441 3.22734C17.3372 2.99993 16.9854 2.97925 16.7537 3.18599L10.0084 9.23509L8.69246 8.06083C8.68832 8.05669 8.68418 8.05256 8.68418 8.04843C8.65522 8.01948 8.62625 7.99467 8.59314 7.96987L3.2383 3.18186C3.00656 2.97512 2.65482 2.99579 2.44791 3.22734C2.241 3.45888 2.26169 3.81033 2.49343 4.01707L7.44272 8.43709L2.51412 13.0473C2.29065 13.2582 2.27824 13.6096 2.48929 13.837C2.60102 13.9528 2.75 14.0148 2.89897 14.0148C3.03553 14.0148 3.17209 13.9652 3.27969 13.866L8.28278 9.18961L9.64011 10.4011C9.7477 10.4962 9.88013 10.5417 10.0125 10.5417C10.145 10.5417 10.2815 10.492 10.385 10.3969L11.7796 9.14826L16.7537 13.8701C16.8613 13.9735 17.002 14.0231 17.1385 14.0231C17.2875 14.0231 17.4324 13.9652 17.5441 13.8494C17.7551 13.6262 17.7469 13.2706 17.5234 13.0597L12.6113 8.39988Z" fill="#FF7D04"/>
              </svg>

            <a href="<?php echo carbon_get_post_meta('36','email');?>">
              <?php echo carbon_get_post_meta('36','email');?>
            </a >
            </div>
            
          </div>
          <div class="top-ifo-item">
            <div class="top-info-item-wrap">
              <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M16.0743 19.8347C15.2422 19.8347 14.2372 19.6279 13.1319 19.2142C10.7089 18.3083 8.07255 16.5177 5.70869 14.1733C3.34416 11.8283 1.53863 9.21316 0.624435 6.81013C-0.206348 4.62525 -0.208366 2.83198 0.619726 2.0114C0.738794 1.89331 0.859879 1.76656 0.985001 1.6358C1.74044 0.847907 2.5941 -0.038721 3.72558 0.00130734C4.50523 0.03333 5.26067 0.51367 6.03428 1.46835C8.32011 4.28768 7.28953 5.29239 6.09684 6.45721L5.88628 6.66403C5.6912 6.8575 5.32256 7.75346 8.75198 11.1545C9.87135 12.2647 10.8259 13.0772 11.5887 13.5689C12.0691 13.8785 12.9281 14.3468 13.2806 13.9972L13.4925 13.7851C14.6657 12.6049 15.6788 11.5862 18.5196 13.8511C19.4822 14.6183 19.9659 15.3669 19.9982 16.1414C20.0446 17.2629 19.1438 18.1115 18.3487 18.86C18.2175 18.9841 18.0897 19.1042 17.9706 19.2216C17.5596 19.6299 16.9024 19.8347 16.0743 19.8347ZM3.64485 0.667112C2.84098 0.667112 2.11513 1.42498 1.47271 2.09546C1.34355 2.23022 1.21843 2.36098 1.09532 2.48306C0.478459 3.09416 0.54102 4.69997 1.25408 6.5753C2.13532 8.8916 3.88635 11.4227 6.18496 13.7023C8.4829 15.9806 11.0338 17.7172 13.3701 18.5905C15.261 19.299 16.8802 19.359 17.4957 18.7486C17.6188 18.6265 17.7507 18.5024 17.8866 18.375C18.5774 17.7239 19.3611 16.986 19.3268 16.1674C19.3033 15.605 18.8902 14.9999 18.0991 14.3695C15.7319 12.4815 15.07 13.148 13.9721 14.2521L13.7569 14.4676C13.2322 14.9886 12.3798 14.8732 11.2228 14.1273C10.4203 13.6096 9.42871 12.7677 8.27705 11.6249C5.43087 8.80287 4.5207 7.07565 5.41136 6.19036L5.62595 5.98021C6.74196 4.89144 7.41533 4.2343 5.51092 1.88531C4.87387 1.10142 4.26441 0.691796 3.69732 0.667779C3.67983 0.667112 3.66234 0.667112 3.64485 0.667112Z" fill="#FF7D04"/>
              </svg>
              <a href="tel:<?php echo carbon_get_post_meta('36','phone1');?>"><?php echo carbon_get_post_meta('36','phone1');?></a>
              
            </div>
            
          </div>
          <div class="top-ifo-item">
            <div class="top-info-item-wrap">
              <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M16.0743 19.8347C15.2422 19.8347 14.2372 19.6279 13.1319 19.2142C10.7089 18.3083 8.07255 16.5177 5.70869 14.1733C3.34416 11.8283 1.53863 9.21316 0.624435 6.81013C-0.206348 4.62525 -0.208366 2.83198 0.619726 2.0114C0.738794 1.89331 0.859879 1.76656 0.985001 1.6358C1.74044 0.847907 2.5941 -0.038721 3.72558 0.00130734C4.50523 0.03333 5.26067 0.51367 6.03428 1.46835C8.32011 4.28768 7.28953 5.29239 6.09684 6.45721L5.88628 6.66403C5.6912 6.8575 5.32256 7.75346 8.75198 11.1545C9.87135 12.2647 10.8259 13.0772 11.5887 13.5689C12.0691 13.8785 12.9281 14.3468 13.2806 13.9972L13.4925 13.7851C14.6657 12.6049 15.6788 11.5862 18.5196 13.8511C19.4822 14.6183 19.9659 15.3669 19.9982 16.1414C20.0446 17.2629 19.1438 18.1115 18.3487 18.86C18.2175 18.9841 18.0897 19.1042 17.9706 19.2216C17.5596 19.6299 16.9024 19.8347 16.0743 19.8347ZM3.64485 0.667112C2.84098 0.667112 2.11513 1.42498 1.47271 2.09546C1.34355 2.23022 1.21843 2.36098 1.09532 2.48306C0.478459 3.09416 0.54102 4.69997 1.25408 6.5753C2.13532 8.8916 3.88635 11.4227 6.18496 13.7023C8.4829 15.9806 11.0338 17.7172 13.3701 18.5905C15.261 19.299 16.8802 19.359 17.4957 18.7486C17.6188 18.6265 17.7507 18.5024 17.8866 18.375C18.5774 17.7239 19.3611 16.986 19.3268 16.1674C19.3033 15.605 18.8902 14.9999 18.0991 14.3695C15.7319 12.4815 15.07 13.148 13.9721 14.2521L13.7569 14.4676C13.2322 14.9886 12.3798 14.8732 11.2228 14.1273C10.4203 13.6096 9.42871 12.7677 8.27705 11.6249C5.43087 8.80287 4.5207 7.07565 5.41136 6.19036L5.62595 5.98021C6.74196 4.89144 7.41533 4.2343 5.51092 1.88531C4.87387 1.10142 4.26441 0.691796 3.69732 0.667779C3.67983 0.667112 3.66234 0.667112 3.64485 0.667112Z" fill="#FF7D04"/>
              </svg>
              <a href="tel:<?php echo carbon_get_post_meta('36','phone2');?>">
                <?php echo carbon_get_post_meta('36','phone2');?>
              </a>
              

            </div>
            
          </div>
        </div>
      </div>
      <div class="nav">
        <?php
          wp_nav_menu( array(
            'menu'            => 'Main',              // (string) Название выводимого меню (указывается в админке при создании меню, приоритетнее 
                                // чем указанное местоположение theme_location - если указано, то параметр theme_location игнорируется)
            'container'       => '',           // (string) Контейнер меню. Обворачиватель ul. Указывается тег контейнера (по умолчанию в тег div)
            'container_class' => '',              // (string) class контейнера (div тега)
            'container_id'    => '',              // (string) id контейнера (div тега)
            'menu_class'      => ' ',          // (string) class самого меню (ul тега)
            'menu_id'         => '',              // (string) id самого меню (ul тега)
            'echo'            => true,            // (boolean) Выводить на экран или возвращать для обработки
            'fallback_cb'     => 'wp_page_menu',  // (string) Используемая (резервная) функция, если меню не существует (не удалось получить)
            'before'          => '',              // (string) Текст перед <a> каждой ссылки
            'after'           => '',              // (string) Текст после </a> каждой ссылки
            'link_before'     => '',              // (string) Текст перед анкором (текстом) ссылки
            'link_after'      => '',              // (string) Текст после анкора (текста) ссылки
            'depth'           => 0,               // (integer) Глубина вложенности (0 - неограничена, 2 - двухуровневое меню)
            'walker'          => '',              // (object) Класс собирающий меню. Default: new Walker_Nav_Menu
            'theme_location'  => ''               // (string) Расположение меню в шаблоне. (указывается ключ которым было зарегистрировано меню в функции register_nav_menus)
          ) );


          ?>
        <!-- <ul>
          <li>
            <a href="#" class="active-class">Главная</a>
          </li>
          <li>
            <a href="#">О нас</a>
          </li>
          <li>
            <a href="#">Каталог продукции</a>
          </li>
          <li>
            <a href="#">Услуги</a>
          </li>
          <li>
            <a href="#">Новости</a>
          </li>
          <li>
            <a href="#">Конткты</a>
          </li>
        </ul> -->
        
        <div class="btn-wrap">
          <div class=" btn-menu">
            <a href="#">Написать нам</a>
          </div>
        </div>
        
        
      </div>
    </div>
    <div id="btn-box" class="btn-box">
      <span class="span"></span>
      <span class="span"></span>
      <span class="span"></span>
    </div>
  </div>
  <div class="mobi-nav">
    <ul>
      <li>
        <a class="active-class" href="#">
          Главная
        </a>
      </li>
      <li>
        <a href="#">
          О нас
        </a>
      </li>
      <li>
        <a href="#">
          Каталог продукции
        </a>
      </li>
      <li>
        <a href="#">
          Услуги
        </a>
      </li>
      <li>
        <a href="#">
          Новости
        </a>
      </li>
      <li>
        <a href="#">
          Контакты
        </a>
      </li>
    </ul>
  </div>
 </header>


